my-literate-emacs-configuration.org
** =rainbow-delimiters=

[[https://github.com/Fanael/rainbow-delimiters][More Information]]

#+BEGIN_SRC emacs-lisp
    (use-package rainbow-delimiters
      :hook
      (prog-mode . rainbow-delimiters-mode))
#+END_SRC

** =dimmer.el=

[[https://github.com/gonewest818/dimmer.el][More Information]]

#+BEGIN_SRC emacs-lisp
  (use-package dimmer
    :config
    (setq dimmer-fraction 0.5)
    (dimmer-mode t))
#+END_SRC
* Org-Mode
** =org-mode=

Install org-mode from the org package repository.

[[https://orgmode.org/][More Information]]

#+BEGIN_SRC emacs-lisp
  (use-package org
    :pin org
    :config
    (add-to-list 'org-modules 'org-tempo)) ;; add "<s <TAB>" for code block completion
#+END_SRC

** =toc-org=

Install the =toc-org= package to automatically generate an updated table of contents.

[[https://github.com/snosov1/toc-org][More Information]]

#+BEGIN_SRC emacs-lisp
  (use-package toc-org
    :after org
    :hook
    (org-mode . toc-org-enable))
#+END_SRC

** =org-bullets=

[[https://github.com/sabof/org-bullets][More Information]]

#+BEGIN_SRC emacs-lisp
  (use-package org-bullets
    :hook
    (org-mode . (lambda () (org-bullets-mode t))))
 #+END_SRC

** =reveal.js=

Install reveal.js from [[https://github.com/hakimel/reveal.js/][here]]. Then, install [[https://github.com/hexmode/ox-reveal][=ox-reveal=]] and [[https://github.com/hniksic/emacs-htmlize][=htmlize=]].

[[https://github.com/hexmode/ox-reveal][More Information]]

#+BEGIN_SRC emacs-lisp
  (use-package ox-reveal
    :ensure ox-reveal
    :config
    (setq org-reveal-root "/Users/simenojensen/.emacs.d/reveal.js/")
    (setq org-reveal-mathjax t))
#+END_SRC

** =htmlize=

[[https://github.com/hniksic/emacs-htmlize][More Information]]

#+BEGIN_SRC emacs-lisp
  (use-package htmlize)
#+END_SRC

* Elisp Functions
** Edit Configuration File
#+BEGIN_SRC emacs-lisp
  (defun my/edit-config ()
    "Opens the my-literate-emacs-configuration.org file."
    (interactive)
    (find-file "~/.emacs.d/my-literate-emacs-configuration.org"))
#+END_SRC

** =my/toggle-comment-on-line=

Comment or uncomment the current line. Bind to ~C-;~.

#+BEGIN_SRC emacs-lisp
  (defun my/toggle-comment-on-line ()
    (interactive)
    (comment-or-uncomment-region (line-beginning-position) (line-end-position)))

  (bind-key "C-;" 'my/toggle-comment-on-line)
#+END_SRC

* Internet
** =google-this=

[[http://pragmaticemacs.com/emacs/google-search-from-inside-emacs/][More Information]]

#+BEGIN_SRC emacs-lisp
  (use-package google-this
    :diminish
    :config
    (google-this-mode t))
#+END_SRC
